RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/Device/Holtek/HT32F5xxxx/Include/ht32f5xxxx_01.h
/***************************************************************************//**
 * @file    ht32f5xxxx_01.h
 * @brief   CMSIS Cortex-M0+ Device Peripheral Access Layer Header File
 * @version $Rev:: 7319         $
 * @date    $Date:: 2023-10-28 #$
 *
 * @note
 * Copyright (C) Holtek Semiconductor Inc. All rights reserved.
 *
 * @par
 * Holtek supplies this software for Cortex-M processor-based
 * microcontrollers.  This file can be freely distributed within
 * development tools that are supporting such ARM-based processors.
 *
 * @par
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************/

// Supported Device
// ========================================
//   HT32F50020, HT32F50030
//   HT32F50220, HT32F50230
//   HT32F50231, HT32F50241
//   HT32F50343
//   HT32F50431, HT32F50441
//   HT32F50442, HT32F50452
//   HT32F52220, HT32F52230
//   HT32F52231, HT32F52241
//   HT32F52243, HT32F52253
//   HT32F52331, HT32F52341
//   HT32F52342, HT32F52352
//   HT32F52344, HT32F52354
//   HT32F52357, HT32F52367
//   HT32F53231, HT32F53241
//   HT32F53242, HT32F53252
//   HT32F54231, HT32F54241
//   HT32F54243, HT32F54253
//   HT32F57331, HT32F57341
//   HT32F57342, HT32F57352
//   HT32F5826,  HT32F5828
//   HT32F0006
//   HT32F0008
//   HT32F61141
//   HT32F61244, HT32F61245
//   HT32F65230, HT32F65240
//   HT32F65232
//   HT32F66242, HT32F66246
//   HT32F67041, HT32F67051
//   HT32F52234, HT32F52244

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup HT32F5xxxx HT32F5xxxx
  * @{
  */


#ifndef __HT32F5XXXX_01_H__
#define __HT32F5XXXX_01_H__

#include "ht32_config.h"

#ifdef __cplusplus
 extern "C" {
#endif

#if !defined(USE_HT32F52220_30) && \
    !defined(USE_HT32F52231_41) && \
    !defined(USE_HT32F52331_41) && \
    !defined(USE_HT32F52342_52) && \
    !defined(USE_HT32F52243_53) && \
    !defined(USE_HT32F5826) && \
    !defined(USE_HT32F0008) && \
    !defined(USE_HT32F50220_30) && \
    !defined(USE_HT32F50231_41) && \
    !defined(USE_HT32F52344_54) && \
    !defined(USE_HT32F0006) && \
    !defined(USE_HT32F52357_67) && \
    !defined(USE_HT32F65230_40) && \
    !defined(USE_HT32F54231_41) && \
    !defined(USE_HT32F54243_53) && \
    !defined(USE_HT32F57331_41) && \
    !defined(USE_HT32F57342_52) && \
    !defined(USE_HT32F50343) && \
    !defined(USE_HT32F65232) && \
    !defined(USE_HT32F61141) && \
    !defined(USE_HT32F61244_45) && \
    !defined(USE_HT32F50020_30) && \
    !defined(USE_HT32F67041_51) && \
    !defined(USE_HT32F50431_41) && \
    !defined(USE_HT32F50442_52) && \
    !defined(USE_HT32F53231_41) && \
    !defined(USE_HT32F53242_52) && \
    !defined(USE_HT32F66242) && \
    !defined(USE_HT32F66246) && \
    !defined(USE_HT32F52234_44)

  //#define USE_HT32F52220_30
  //#define USE_HT32F52231_41
  //#define USE_HT32F52331_41
  //#define USE_HT32F52342_52
  //#define USE_HT32F52243_53
  //#define USE_HT32F5826
  //#define USE_HT32F0008
  //#define USE_HT32F50220_30
  //#define USE_HT32F50231_41
  //#define USE_HT32F52344_54
  //#define USE_HT32F0006
  //#define USE_HT32F52357_67
  //#define USE_HT32F65230_40
  //#define USE_HT32F54231_41
  //#define USE_HT32F54243_53
  //#define USE_HT32F57331_41
  //#define USE_HT32F57342_52
  //#define USE_HT32F50343
  //#define USE_HT32F65232
  //#define USE_HT32F61141
  //#define USE_HT32F61244_45
  //#define USE_HT32F50020_30
  //#define USE_HT32F67041_51
  //#define USE_HT32F50431_41
  //#define USE_HT32F50442_52
  //#define USE_HT32F53231_41
  //#define USE_HT32F53242_52
  //#define USE_HT32F66242
  //#define USE_HT32F66246
  //#define USE_HT32F52234_44

#endif

#if !defined(USE_NOCHIP) && \
    !defined(USE_HT32F52220_30) && \
    !defined(USE_HT32F52231_41) && \
    !defined(USE_HT32F52331_41) && \
    !defined(USE_HT32F52342_52) && \
    !defined(USE_HT32F52243_53) && \
    !defined(USE_HT32F5826) && \
    !defined(USE_HT32F0008) && \
    !defined(USE_HT32F50220_30) && \
    !defined(USE_HT32F50231_41) && \
    !defined(USE_HT32F52344_54) && \
    !defined(USE_HT32F0006) && \
    !defined(USE_HT32F52357_67) && \
    !defined(USE_HT32F65230_40) && \
    !defined(USE_HT32F54231_41) && \
    !defined(USE_HT32F54243_53) && \
    !defined(USE_HT32F57331_41) && \
    !defined(USE_HT32F57342_52) && \
    !defined(USE_HT32F50343) && \
    !defined(USE_HT32F65232) && \
    !defined(USE_HT32F61141) && \
    !defined(USE_HT32F61244_45) && \
    !defined(USE_HT32F50020_30) && \
    !defined(USE_HT32F67041_51) && \
    !defined(USE_HT32F50431_41) && \
    !defined(USE_HT32F50442_52) && \
    !defined(USE_HT32F53231_41) && \
    !defined(USE_HT32F53242_52) && \
    !defined(USE_HT32F66242) && \
    !defined(USE_HT32F66246) && \
    !defined(USE_HT32F52234_44)

  #error Please add "USE_HT32Fxxxxx_xx" define into C Preprocessor Symbols of the Project configuration.

#endif

/** @addtogroup Library_configuration_section
  * @{
  */
/**
 * @brief Value of the High Speed Internal oscillator in Hz
  */
#if defined(USE_HT32F50220_30) || defined(USE_HT32F50231_41)
  #define HSI_VALUE      20000000UL  /*!< Value of the Internal High Speed oscillator in Hz                 */
#elif defined(USE_HT32F50020_30)
  #define HSI_VALUE      16000000UL  /*!< Value of the Internal High Speed oscillator in Hz                 */
#else
  #define HSI_VALUE      8000000UL   /*!< Value of the High Speed Internal oscillator in Hz                 */
#endif

/**
 * @brief Value of the Low Speed Internal oscillator in Hz
  */
#define LSI_VALUE         32000UL     /*!< Value of the Low Speed Internal oscillator in Hz                 */

#if !defined(USE_HT32F52220_30) && !defined(USE_HT32F66242) && !defined(USE_HT32F66246)
/**
 * @brief Value of the Low Speed External oscillator in Hz
  */
#define LSE_VALUE         32768UL     /*!< Value of the Low Speed External oscillator in Hz                 */
#endif

/**
 * @brief Adjust the High Speed External oscillator (HSE) Startup Timeout value
   */
#define HSE_READY_TIME    ((uint16_t)0xFFFF)    /*!< Time out for HSE start up                              */
/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
#define __MPU_PRESENT             0    /*!< MPU present or not                                              */
#define __VTOR_PRESENT            1    /*!< VTOR present or not                                             */
#define __NVIC_PRIO_BITS          2    /*!< Number of Bits used for Priority Levels                         */
#define __Vendor_SysTickConfig    0    /*!< Set to 1 if different SysTick Config is used                    */

/**
  * @}
  */


/** @addtogroup Configuration_for_Interrupt_Number
  * @{
  */
typedef enum IRQn
{
/****** Cortex-M0+ Processor Exceptions Numbers ********************************                            */
  NonMaskableInt_IRQn     = -14,    /*!< 2 Non Maskable Interrupt                                           */
  HardFault_IRQn          = -13,    /*!< 3 Cortex-M0+ Hard Fault Interrupt                                  */
  SVCall_IRQn             = -5,     /*!< 11 Cortex-M0+ SV Call Interrupt                                    */
  PendSV_IRQn             = -2,     /*!< 14 Cortex-M0+ Pend SV Interrupt                                    */
  SysTick_IRQn            = -1,     /*!< 15 Cortex-M0+ System Tick Interrupt                                */

/******  HT32 Specific Interrupt Numbers ***************************************                            */
  LVD_BOD_IRQn            = 0,      /*!< Low voltage & Brown-out detection interrupt                        */
  #if !defined(USE_HT32F52220_30)
  RTC_IRQn                = 1,      /*!< RTC Wake-up Interrupt                                              */
  #endif
  FLASH_IRQn              = 2,      /*!< FLASH global Interrupt                                             */
  EVWUP_IRQn              = 3,      /*!< EXTI Event Wake-up & WAKEUP pin Interrupt                          */
  EXTI0_1_IRQn            = 4,      /*!< EXTI0-1 Line detection Interrupt                                   */
  EXTI2_3_IRQn            = 5,      /*!< EXTI2-3 Line detection Interrupt                                   */
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232)
  EXTI4_9_IRQn            = 6,      /*!< EXTI4-9 Line detection Interrupt                                   */
  #elif defined(USE_HT32F50020_30)
  EXTI4_7_IRQn            = 6,      /*!< EXTI4-7 Line detection Interrupt                                   */
  #else
  EXTI4_15_IRQn           = 6,      /*!< EXTI4-15 Line detection Interrupt                                  */
  #endif
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F66242) || defined(USE_HT32F66246)
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232)
  EXTI10_15_IRQn          = 7,      /*!< EXTI10-15 Line detection Interrupt                                 */
  #elif defined(USE_HT32F66246)
  CAN0_IRQn               = 7,      /*!< CAN0 global Interrupt                                              */
  #endif
  ADC0_IRQn               = 8,      /*!< ADC0 Interrupt                                                     */
  #if defined(USE_HT32F65230_40)
  ADC1_IRQn               = 9,      /*!< ADC1 Interrupt                                                     */
  #elif defined(USE_HT32F66242)
  CORDIC_IRQn             = 9,      /*!< CORDIC global Interrupt                                            */
  #elif defined(USE_HT32F66246)
  CORDIC_IRQn             = 9,      /*!< CORDIC global Interrupt                                            */
  #endif
  MCTM0_BRK_IRQn          = 10,     /*!< MCTM BRK Interrupt                                                 */
  MCTM0_UP_IRQn           = 11,     /*!< MCTM UP Interrupt                                                  */
  MCTM0_TR_UP2_IRQn       = 12,     /*!< MCTM TR & UP2 Interrupt                                            */
  MCTM0_CC_IRQn           = 13,     /*!< MCTM CC Interrupt                                                  */
  GPTM0_G_IRQn            = 14,     /*!< GPTM G Interrupt                                                   */
  GPTM0_VCLK_IRQn         = 15,     /*!< GPTM VCLK Interrupt                                                */
  BFTM0_IRQn              = 16,     /*!< Basic Function Timer0 Interrupt                                    */
  BFTM1_IRQn              = 17,     /*!< Basic Function Timer1 Interrupt                                    */
  CMP0_IRQn               = 18,     /*!< Comparator0 Interrupt                                              */
  CMP1_IRQn               = 19,     /*!< Comparator1 Interrupt                                              */
  #if defined(USE_HT32F65230_40)
  CMP2_IRQn               = 20,     /*!< Comparator2 Interrupt                                              */
  #elif defined(USE_HT32F66242)
  PID_IRQn                = 20,     /*!< PID global Interrupt                                               */
  #elif defined(USE_HT32F66246)
  PID_IRQn                = 20,     /*!< PID global Interrupt                                               */
  #endif
  I2C0_IRQn               = 21,     /*!< I2C global Interrupt                                               */
  SPI0_IRQn               = 22,     /*!< SPI global Interrupt                                               */
  USART0_IRQn             = 23,     /*!< USART global Interrupt                                             */
  UART0_IRQn              = 24,     /*!< UART global Interrupt                                              */
  PDMACH0_1_IRQn          = 25,     /*!< PDMA channel 0-1 Interrupt                                         */
  PDMACH2_3_IRQn          = 26,     /*!< PDMA channel 2-3 Interrupt                                         */
  PDMACH4_5_IRQn          = 27,     /*!< PDMA channel 4-5 Interrupt                                         */
  SCTM0_IRQn              = 28,     /*!< Single Channel Timer0 Interrupt                                    */
  SCTM1_IRQn              = 29,     /*!< Single Channel Timer1 Interrupt                                    */
  SCTM2_IRQn              = 30,     /*!< Single Channel Timer2 Interrupt                                    */
  SCTM3_IRQn              = 31,     /*!< Single Channel Timer3 Interrupt                                    */
  #else
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F52344_54) || defined(USE_HT32F54243_53) || defined(USE_HT32F53242_52) || defined(USE_HT32F50442_52)
  COMP_IRQn               = 7,      /*!< Comparator global Interrupt                                        */
  #endif
  #if defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52)
  COMP_DAC_IRQn           = 7,      /*!< Comparator & DAC global Interrupt                                  */
  #endif
  #if defined(USE_HT32F52234_44)
  DAC0_1_IRQn             = 7,      /*!< DAC0 & DAC1 global Interrupt                                       */
  #endif
  #if !defined(USE_HT32F0008)
  ADC0_IRQn               = 8,      /*!< ADC Interrupt                                                      */
  #endif
  #if defined(USE_HT32F52243_53) || defined(USE_HT32F54243_53) || defined(USE_HT32F52234_44)
  I2C2_IRQn               = 9,      /*!< I2C2 global Interrupt                                              */
  #endif
  #if defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F67041_51)
  AES_IRQn                = 9,      /*!< AES global Interrupt                                               */
  #endif
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F0006) && !defined(USE_HT32F57342_52) && !defined(USE_HT32F57331_41) && !defined(USE_HT32F50343) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F50020_30) && !defined(USE_HT32F67041_51) && !defined(USE_HT32F52234_44)
  MCTM0_IRQn              = 10,     /*!< Motor Control Timer0 interrupt                                     */
  #endif
  #if defined(USE_HT32F50343)
  PWM2_IRQn               = 10,     /*!< PWM Timer2 interrupt                                               */
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F5826)
  GPTM1_IRQn              = 11,     /*!< General-Purpose Timer1 Interrupt                                   */
  #endif
  #if defined(USE_HT32F52357_67)
  QSPI_IRQn               = 11,     /*!< QSPI global Interrupt                                              */
  #endif
  #if defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41)
  LCD_IRQn                = 11,     /*!< LCD global Interrupt                                               */
  #endif
  #if defined(USE_HT32F54231_41) || defined(USE_HT32F54243_53)
  TKEY_IRQn               = 11,     /*!< Touch-Key global Interrupt                                         */
  #endif
  #if defined(USE_HT32F67041_51)
  RF_IRQn                 = 11,     /*!< 2.4G RF global Interrupt                                           */
  #endif
  #if !defined(USE_HT32F50020_30) && !defined(USE_HT32F52234_44)
  GPTM0_IRQn              = 12,     /*!< General-Purpose Timer0 Interrupt                                   */
  #endif
  #if !defined(USE_HT32F0008) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F50231_41) && !defined(USE_HT32F57331_41) && !defined(USE_HT32F53231_41) && !defined(USE_HT32F53242_52) && !defined(USE_HT32F50431_41) && !defined(USE_HT32F50442_52)
  SCTM0_IRQn              = 13,     /*!< Single Channel Timer0 Interrupt                                    */
  SCTM1_IRQn              = 14,     /*!< Single Channel Timer1 Interrupt                                    */
  #endif
  #if defined(USE_HT32F52231_41) || defined(USE_HT32F52331_41) || defined(USE_HT32F52243_53) || defined(USE_HT32F0006) || defined(USE_HT32F54243_53) || defined(USE_HT32F50020_30) || defined(USE_HT32F67041_51)
  SCTM2_IRQn              = 15,     /*!< Single Channel Timer2 Interrupt                                    */
  #endif
  #if defined(USE_HT32F52231_41) || defined(USE_HT32F52331_41) || defined(USE_HT32F52243_53) || defined(USE_HT32F0006) || defined(USE_HT32F54243_53) || defined(USE_HT32F67041_51)
  SCTM3_IRQn              = 16,     /*!< Single Channel Timer3 Interrupt                                    */
  #endif
  #if defined(USE_HT32F0008) || defined(USE_HT32F50220_30) || defined(USE_HT32F50231_41) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F50343) || defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52) || defined(USE_HT32F50431_41) || defined(USE_HT32F50442_52) || defined(USE_HT32F52234_44)
  PWM0_IRQn               = 15,     /*!< PWM Timer0 Interrupt                                               */
  #endif
  #if defined(USE_HT32F0008) || defined(USE_HT32F50220_30) || defined(USE_HT32F50231_41) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F50343) || defined(USE_HT32F53242_52) || defined(USE_HT32F50442_52)
  PWM1_IRQn               = 16,     /*!< PWM Timer1 Interrupt                                               */
  #endif
  BFTM0_IRQn              = 17,     /*!< Basic Function Timer0 Interrupt                                    */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F50020_30)
  BFTM1_IRQn              = 18,     /*!< Basic Function Timer1 Interrupt                                    */
  #endif
  I2C0_IRQn               = 19,     /*!< I2C0 global Interrupt                                              */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F50220_30) && !defined(USE_HT32F52344_54) && !defined(USE_HT32F0006) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F50020_30)
  I2C1_IRQn               = 20,     /*!< I2C1 global Interrupt                                              */
  #endif
  SPI0_IRQn               = 21,     /*!< SPI0 global Interrupt                                              */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F0006) && !defined(USE_HT32F50020_30) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F52234_44)
  SPI1_IRQn               = 22,     /*!< SPI1 global Interrupt                                              */
  #endif
  #if defined(USE_HT32F0006) || defined(USE_HT32F61244_45)
  QSPI_IRQn               = 22,     /*!< QSPI global Interrupt                                              */
  #endif
  #if !defined(USE_HT32F50220_30) && !defined(USE_HT32F52344_54) && !defined(USE_HT32F50343) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F50020_30) && !defined(USE_HT32F67041_51)
  USART0_IRQn             = 23,     /*!< USART0 global Interrupt                                            */
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F52243_53) || defined(USE_HT32F5826) || defined(USE_HT32F52357_67) || defined(USE_HT32F54243_53) || defined(USE_HT32F53242_52) || defined(USE_HT32F50442_52)
  USART1_IRQn             = 24,     /*!< USART1 global Interrupt                                            */
  #endif
  UART0_IRQn              = 25,     /*!< UART0 global Interrupt                                             */
  #if !defined(USE_HT32F52220_30) && !defined(USE_HT32F0008) && !defined(USE_HT32F0006) && !defined(USE_HT32F61244_45) && !defined(USE_HT32F52234_44)
  UART1_IRQn              = 26,     /*!< UART1 global Interrupt                                             */
  #endif
  #if defined(USE_HT32F52357_67)
  UART0_UART2_IRQn        = 25,     /*!< UART0 & UART2 global Interrupt                                     */
  UART1_UART3_IRQn        = 26,     /*!< UART1 & UART3 global Interrupt                                     */
  #endif
  #if defined(USE_HT32F52331_41) || defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F61141)
  SCI_IRQn                = 27,     /*!< Smart Card Interface Interrupt                                     */
  #endif
  #if defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52)
  CAN0_IRQn               = 27,     /*!< CAN0 global Interrupt                                              */
  #endif
  #if defined(USE_HT32F0006) || defined(USE_HT32F61244_45)
  MIDI_IRQn               = 27,     /*!< MIDI global Interrupt                                              */
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F0006) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52)
  I2S_IRQn                = 28,     /*!< I2S global Interrupt                                               */
  #endif
  #if defined(USE_HT32F52243_53) || defined(USE_HT32F54243_53)
  UART2_IRQn              = 27,     /*!< UART2 global Interrupt                                             */
  UART3_IRQn              = 28,     /*!< UART3 global Interrupt                                             */
  #endif
  #if defined(USE_HT32F0008)
  AES_IRQn                = 28,     /*!< AES global Interrupt                                               */
  #endif
  #if defined(USE_HT32F50343)
  SLED0_IRQn              = 27,     /*!< SLED0 global Interrupt                                             */
  SLED1_IRQn              = 28,     /*!< SLED1 global Interrupt                                             */
  #endif
  #if defined(USE_HT32F52331_41) || defined(USE_HT32F52342_52) || defined(USE_HT32F5826) || defined(USE_HT32F0008) || defined(USE_HT32F52344_54) || defined(USE_HT32F0006) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F57331_41) || defined(USE_HT32F50343) || defined(USE_HT32F61141)
  USB_IRQn                = 29,     /*!< USB interrupt                                                      */
  #endif
  #if defined(USE_HT32F54231_41) || defined(USE_HT32F54243_53) || defined(USE_HT32F50020_30) || defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52) || defined(USE_HT32F50431_41) || defined(USE_HT32F50442_52)
  LEDC_IRQn               = 29,     /*!< LEDC global Interrupt                                              */  
  #endif
  #if defined(USE_HT32F52342_52) || defined(USE_HT32F52243_53) || defined(USE_HT32F5826) || defined(USE_HT32F0008) || defined(USE_HT32F52344_54) || defined(USE_HT32F0006) || defined(USE_HT32F52357_67) || defined(USE_HT32F57342_52) || defined(USE_HT32F50343) || defined(USE_HT32F54243_53) || defined(USE_HT32F61244_45) || defined(USE_HT32F67041_51) || defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52) || defined(USE_HT32F50431_41) || defined(USE_HT32F50442_52) || defined(USE_HT32F52234_44)
  PDMACH0_1_IRQn          = 30,     /*!< PDMA channel 0-1 interrupt                                         */
  PDMACH2_5_IRQn          = 31,     /*!< PDMA channel 2-5 interrupt                                         */
  #endif
  #endif
} IRQn_Type;

