RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/Device/Holtek/HT32F5xxxx/Include/ht32f5xxxx_01.h
/**
 * @brief PWM Timer
 */
typedef struct
{
                                 /* PWM0: 0x40031000                                                        */
                                 /* PWM2: 0x40032000                                                        */
                                 /* PWM1: 0x40071000                                                        */
  __IO uint32_t CNTCFR;          /*!< 0x000          Counter Configuration Register                         */
  __IO uint32_t MDCFR;           /*!< 0x004          Mode Configuration Register                            */
  __IO uint32_t TRCFR;           /*!< 0x008          Trigger Configuration Register                         */
       uint32_t RESERVED0[1];    /*!< 0x00C          Reserved                                               */
  __IO uint32_t CTR;             /*!< 0x010          Control Register                                       */
       uint32_t RESERVED1[11];   /*!< 0x014 - 0x03C  Reserved                                               */
  __IO uint32_t CH0OCFR;         /*!< 0x040          Channel-0 Output Configuration Register                */
  __IO uint32_t CH1OCFR;         /*!< 0x044          Channel-1 Output Configuration Register                */
  __IO uint32_t CH2OCFR;         /*!< 0x048          Channel-2 Output Configuration Register                */
  __IO uint32_t CH3OCFR;         /*!< 0x04C          Channel-3 Output Configuration Register                */
  __IO uint32_t CHCTR;           /*!< 0x050          Channel Control Register                               */
  __IO uint32_t CHPOLR;          /*!< 0x054          Channel Polarity Configuration Register                */
       uint32_t RESERVED2[7];    /*!< 0x058 - 0x070  Reserved                                               */
  __IO uint32_t DICTR;           /*!< 0x074          DMA / Interrupt Control Register                       */
  __IO uint32_t EVGR;            /*!< 0x078          Event Generator Register                               */
  __IO uint32_t INTSR;           /*!< 0x07C          Interrupt Status Register                              */
  __IO uint32_t CNTR;            /*!< 0x080          Counter Register                                       */
  __IO uint32_t PSCR;            /*!< 0x084          Prescaler Register                                     */
  __IO uint32_t CRR;             /*!< 0x088          Counter Reload Register                                */
       uint32_t RESERVED3[1];    /*!< 0x08C          Reserved                                               */
  __IO uint32_t CH0CR;           /*!< 0x090          Channel 0 Compare Register                             */
  __IO uint32_t CH1CR;           /*!< 0x094          Channel 1 Compare Register                             */
  __IO uint32_t CH2CR;           /*!< 0x098          Channel 2 Compare Register                             */
  __IO uint32_t CH3CR;           /*!< 0x09C          Channel 3 Compare Register                             */
  __IO uint32_t CH0ACR;          /*!< 0x0A0          Channel 0 Asymmetric Compare Register                  */
  __IO uint32_t CH1ACR;          /*!< 0x0A4          Channel 1 Asymmetric Compare Register                  */
  __IO uint32_t CH2ACR;          /*!< 0x0A8          Channel 2 Asymmetric Compare Register                  */
  __IO uint32_t CH3ACR;          /*!< 0x0AC          Channel 3 Asymmetric Compare Register                  */
  #if defined(USE_HT32F50343)
       uint32_t RESERVED4[20];   /*!< 0x0B0 - 0x0FC  Reserved                                               */
  __IO uint32_t CH4OCFR;         /*!< 0x100          Channel-4 Output Configuration Register                */
  __IO uint32_t CH5OCFR;         /*!< 0x104          Channel-5 Output Configuration Register                */
  __IO uint32_t CH6OCFR;         /*!< 0x108          Channel-6 Output Configuration Register                */
  __IO uint32_t CH7OCFR;         /*!< 0x10C          Channel-7 Output Configuration Register                */
  __IO uint32_t CH4CR;           /*!< 0x110          Channel 4 Compare Register                             */
  __IO uint32_t CH5CR;           /*!< 0x114          Channel 5 Compare Register                             */
  __IO uint32_t CH6CR;           /*!< 0x118          Channel 6 Compare Register                             */
  __IO uint32_t CH7CR;           /*!< 0x11C          Channel 7 Compare Register                             */
  #endif
} HT_PWM_TypeDef;


/**
 * @brief Single Channel Timer
 */
typedef struct
{
                                 /* SCTM0: 0x40034000                                                       */
                                 /* SCTM1: 0x40074000                                                       */
                                 /* SCTM2: 0x40035000                                                       */
                                 /* SCTM3: 0x40075000                                                       */
  __IO uint32_t CNTCFR;          /*!< 0x000          Counter Configuration Register                         */
  __IO uint32_t MDCFR;           /*!< 0x004          Mode Configuration Register                            */
  __IO uint32_t TRCFR;           /*!< 0x008          Trigger Configuration Register                         */
       uint32_t RESERVED0[1];    /*!< 0x00C          Reserved                                               */
  __IO uint32_t CTR;             /*!< 0x010          Control Register                                       */
       uint32_t RESERVED1[3];    /*!< 0x014 - 0x01C  Reserved                                               */
  __IO uint32_t CH0ICFR;         /*!< 0x020          Channel 0 Input Configuration Register                 */
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F66242) || defined(USE_HT32F66246)
  __IO uint32_t CH1ICFR;         /*!< 0x024          Channel 1 Input Configuration Register                 */
       uint32_t RESERVED2[6];    /*!< 0x028 - 0x03C  Reserved                                               */
  #else
       uint32_t RESERVED2[7];    /*!< 0x024 - 0x03C  Reserved                                               */
  #endif
  __IO uint32_t CHOCFR;          /*!< 0x040          Channel Output Configuration Register                  */
  #if defined(USE_HT32F50020_30)
  __IO uint32_t CH1OCFR;         /*!< 0x044          Channel 1 Output Configuration Register                */
       uint32_t RESERVED3[2];    /*!< 0x048 - 0x04C  Reserved                                               */
  #else
       uint32_t RESERVED3[3];    /*!< 0x044 - 0x04C  Reserved                                               */
  #endif
  __IO uint32_t CHCTR;           /*!< 0x050          Channel Control Register                               */
  __IO uint32_t CHPOLR;          /*!< 0x054          Channel Polarity Configuration Register                */
       uint32_t RESERVED4[7];    /*!< 0x058 - 0x070  Reserved                                               */
  __IO uint32_t DICTR;           /*!< 0x074          Interrupt Control Register                             */
  __IO uint32_t EVGR;            /*!< 0x078          Event Generator Register                               */
  __IO uint32_t INTSR;           /*!< 0x07C          Interrupt Status Register                              */
  __IO uint32_t CNTR;            /*!< 0x080          Counter Register                                       */
  __IO uint32_t PSCR;            /*!< 0x084          Prescaler Register                                     */
  __IO uint32_t CRR;             /*!< 0x088          Counter Reload Register                                */
       uint32_t RESERVED5[1];    /*!< 0x08C          Reserved                                               */
  __IO uint32_t CH0CCR;          /*!< 0x090          Channel 0 Capture/Compare Register                     */
  #if defined(USE_HT32F65230_40) || defined(USE_HT32F65232) || defined(USE_HT32F50020_30) || defined(USE_HT32F66242) || defined(USE_HT32F66246)
  __IO uint32_t CH1CCR;          /*!< 0x094          Channel 1 Capture Register                             */
  #endif
} HT_SCTM_TypeDef;


/**
 * @brief Divider
 */
typedef struct
{
                                 /* DIV: 0x400CA000                                                         */
  __IO uint32_t CR;              /*!< 0x000         Control Register                                        */
  __IO uint32_t DDR;             /*!< 0x004         Dividend register                                       */
  __IO uint32_t DSR;             /*!< 0x008         Divisor Register                                        */
  __IO uint32_t QTR;             /*!< 0x00C         Quotient Register                                       */
  __IO uint32_t RMR;             /*!< 0x010         Remainder Register                                      */
} HT_DIV_TypeDef;


/**
 * @brief Advanced Encryption Standard
 */
typedef struct
{
                                 /* AES: 0x400C8000                                                         */
  __IO uint32_t CR;              /*!< 0x000         Control Register                                        */
  __IO uint32_t SR;              /*!< 0x004         Status Register                                         */
  __IO uint32_t PDMAR;           /*!< 0x008         PDMA Register                                           */
  __IO uint32_t ISR;             /*!< 0x00C         Interrupt Status Register                               */
  __IO uint32_t IER;             /*!< 0x010         Interrupt Enable Register                               */
  __IO uint32_t DINR;            /*!< 0x014         Data Input Register                                     */
  __IO uint32_t DOUTR;           /*!< 0x018         Data Output Register                                    */
  #if defined(USE_HT32F52357_67)
  __IO uint32_t KEYR[8];         /*!< 0x01C - 0x038 Key Register 0~7                                        */
  #else
  __IO uint32_t KEYR[4];         /*!< 0x01C - 0x028 Key Register 0~3                                        */
       uint32_t RESERVED0[4];    /*!< 0x02C - 0x038 Reserved                                                */
  #endif
  __IO uint32_t IVR[4];          /*!< 0x03C - 0x048 Initial Vector Register 0~3                             */
} HT_AES_TypeDef;


/**
 * @brief MIDI
 */
typedef struct
{
                                 /* MIDI: 0x40060000                                                        */
  __IO uint32_t CHAN;            /*!< 0x000         MIDI Channel Number Select                              */
  __IO uint32_t FREQ;            /*!< 0x004         MIDI Frequency Number                                   */
  __IO uint32_t VOL;             /*!< 0x008         MIDI Volume Control                                     */
  __IO uint32_t ST_ADDR;         /*!< 0x00C         MIDI Start Address                                      */
  __IO uint32_t RE_NUM;          /*!< 0x010         MIDI Repeat Number                                      */
  __IO uint32_t END_ADDR;        /*!< 0x014         MIDI End Address                                        */
  __IO uint32_t IER;             /*!< 0x018         MIDI Interrupt/DMA Enable Register                      */
  __IO uint32_t SR;              /*!< 0x01C         MIDI Status Register                                    */
  __IO uint32_t MCU_CH0;         /*!< 0x020         MIDI MCU Channel 0 data                                 */
  __IO uint32_t MCU_CH1;         /*!< 0x024         MIDI MCU Channel 1 data                                 */
  __IO uint32_t MCU_CH2;         /*!< 0x028         MIDI MCU Channel 2 data                                 */
  __IO uint32_t MCU_CH3;         /*!< 0x02C         MIDI MCU Channel 3 data                                 */
  __IO uint32_t MIDIL;           /*!< 0x030         MIDI Engine Waveform of Left Channel                    */
  __IO uint32_t MIDIR;           /*!< 0x034         MIDI Engine Waveform of Right Channel                   */
  __IO uint32_t SPI_DATA;        /*!< 0x038         MIDI SPI Flash data read                                */
  __IO uint32_t SPI_ADDR;        /*!< 0x03C         MIDI SPI Flash address read                             */
  __IO uint32_t CTRL;            /*!< 0x040         MIDI Control Register                                   */
} HT_MIDI_TypeDef;


/**
 * @brief LCD
 */
typedef struct
{
                                 /* LCD: 0x4001A000                                                         */
  __IO uint32_t CR;              /*!< 0x000         Control Register                                        */
  __IO uint32_t FCR;             /*!< 0x004         Frame Control Register                                  */
  __IO uint32_t IER;             /*!< 0x008         Interrupt Enable Register                               */
  __IO uint32_t SR;              /*!< 0x00C         Status Register                                         */
  __IO uint32_t CLR;             /*!< 0x010         Clear Register                                          */
       uint32_t RESERVED[3];     /*!< 0x014 - 0x020 Reserved                                                */
  __IO uint32_t RAM[16];         /*!< 0x020 - 0x05C Display Memory                                          */
} HT_LCD_TypeDef;


/**
 * @brief Serial SLED Interface
 */
typedef struct
{
                                 /* SLED0: 0x4000E000                                                       */
                                 /* SLED1: 0x4004E000                                                       */
  __IO uint32_t CR;              /*!< 0x000  Control Register                                               */
  __IO uint32_t SR;              /*!< 0x004  Status Register                                                */
  __IO uint32_t CDR;             /*!< 0x008  Clock Divider Register                                         */
  __IO uint32_t TCR;             /*!< 0x00C  Timne Code Register                                            */
  union {
  __IO uint8_t  DR_8BIT;         /*!< 0x010  Data Register, 8-bit access, duplicate 4 times into 32-bit     */
  __IO uint16_t DR_16BIT;        /*!< 0x010  Data Register, 16-bit access, duplicate 2 times into 32-bit    */
  __IO uint32_t DR_32BIT;        /*!< 0x010  Data Register                                                  */
  };
  __IO uint32_t FCR;             /*!< 0x014  FIFO Control Register                                          */
} HT_SLED_TypeDef;


/**
 * @brief Touch Key Module
 */
typedef struct
{
  __IO uint32_t CR;              /*!< 0x000          Touch Key Module Control Register                      */
  __IO uint32_t KCFGR;           /*!< 0x004          Touch Key Module Key Configuration Register            */
  __IO uint32_t SR;              /*!< 0x008          Touch Key Module Status Register                       */
  __IO uint32_t ROCPR;           /*!< 0x00C          Touch Key Module Reference OSC Capacitor Register      */
  __IO uint32_t K3CPR;           /*!< 0x010          Touch Key Module Key 3 Capacitor Register              */
  __IO uint32_t K2CPR;           /*!< 0x014          Touch Key Module Key 2 Capacitor Register              */
  __IO uint32_t K1CPR;           /*!< 0x018          Touch Key Module Key 1 Capacitor Register              */
  __IO uint32_t K0CPR;           /*!< 0x01C          Touch Key Module Key 0 Capacitor Register              */
  __IO uint32_t CFCNTR;          /*!< 0x020          Touch Key Module C/F Counter Register                  */
  __IO uint32_t K3CNTR;          /*!< 0x024          Touch Key Module Key 3 Counter Register                */
  __IO uint32_t K2CNTR;          /*!< 0x028          Touch Key Module Key 2 Counter Register                */
  __IO uint32_t K1CNTR;          /*!< 0x02C          Touch Key Module Key 1 Counter Register                */
  __IO uint32_t K0CNTR;          /*!< 0x030          Touch Key Module Key 0 Counter Register                */
  __IO uint32_t K3THR;           /*!< 0x034          Touch Key Module Key 3 Threshold Register              */
  __IO uint32_t K2THR;           /*!< 0x038          Touch Key Module Key 2 Threshold Register              */
  __IO uint32_t K1THR;           /*!< 0x03C          Touch Key Module Key 1 Threshold Register              */
  __IO uint32_t K0THR;           /*!< 0x040          Touch Key Module Key 0 Threshold Register              */
       uint32_t RESERVED0[47];   /*!< 0x044 - 0x0FC  Reserved                                               */
} HT_TKM_TypeDef;


/**
 * @brief Touch Key
 */
typedef struct
{
                                 /* TKEY: 0x4001A000                                                        */
  __IO uint32_t  TKCR;           /*!< 0x000          Touch Key Control Register                             */
  __IO uint32_t  TKCNTR;         /*!< 0x004          Touch Key Counter Register                             */
  __IO uint32_t  TKTSCRR;        /*!< 0x008          Touch Key Time Slot Counter Reload Register            */
  __IO uint32_t  TKIER;          /*!< 0x00C          Touch Key Interrupt Enable Register                    */
  __IO uint32_t  TKSR;           /*!< 0x010          Touch Key Status Register                              */
       uint32_t  RESERVED0[59];  /*!< 0x014 - 0x0FC  Reserved                                               */
  HT_TKM_TypeDef TKM0;           /*!< 0x100          Touch Key Module 0 registers                           */
  HT_TKM_TypeDef TKM1;           /*!< 0x200          Touch Key Module 1 registers                           */
  HT_TKM_TypeDef TKM2;           /*!< 0x300          Touch Key Module 2 registers                           */
  HT_TKM_TypeDef TKM3;           /*!< 0x400          Touch Key Module 3 registers                           */
  HT_TKM_TypeDef TKM4;           /*!< 0x500          Touch Key Module 4 registers                           */
  HT_TKM_TypeDef TKM5;           /*!< 0x600          Touch Key Module 5 registers                           */
} HT_TKEY_TypeDef;


/**
 * @brief LED Controller
 */
typedef struct
{
                                 /* LEDC: 0x4005A000                                                        */
  __IO uint32_t CR;              /*!< 0x000         LED Control Register                                    */
  __IO uint32_t CER;             /*!< 0x004         LED COM Enable Register                                 */
  __IO uint32_t PCR;             /*!< 0x008         LED Polarity Control Register                           */
  __IO uint32_t IER;             /*!< 0x00C         LED Interrupt Enable Register                           */
  __IO uint32_t SR;              /*!< 0x010         LED Status Register                                     */
  __IO uint32_t DTCR;            /*!< 0x014         LED Dead Time Control Register                          */
  #if defined(USE_HT32F54231_41) || defined(USE_HT32F50020_30) || defined(USE_HT32F53231_41) || defined(USE_HT32F53242_52) || defined(USE_HT32F50431_41) || defined(USE_HT32F50442_52)
  __IO uint32_t DR[8];           /*!< 0x018 - 0x034 LED Data Register                                       */
  #endif
  #if defined(USE_HT32F54243_53)
  __IO uint32_t DR[12];          /*!< 0x018 - 0x044 LED Data Register                                       */
  #endif  
} HT_LEDC_TypeDef;


/**
 * @brief Controller Area Network Interface
 */
typedef struct
{
  __IO uint32_t CREQ;            /*!< 0x000         CAN Interface Command Request Register                  */
  __IO uint32_t CMASK;           /*!< 0x004         CAN Interface Command Mask Register                     */
  __IO uint32_t MASK0;           /*!< 0x008         CAN Interface Mask Register 0                           */
  __IO uint32_t MASK1;           /*!< 0x00C         CAN Interface Mask Register 1                           */
  __IO uint32_t ARB0;            /*!< 0x010         CAN Interface Arbitration Register 0                    */
  __IO uint32_t ARB1;            /*!< 0x014         CAN Interface Arbitration Register 1                    */
  __IO uint32_t MCR;             /*!< 0x018         CAN Interface Message Control Register                  */
  __IO uint32_t DA0R;            /*!< 0x01C         CAN Interface Data A 0 Register                         */
  __IO uint32_t DA1R;            /*!< 0x020         CAN Interface Data A 1 Register                         */
  __IO uint32_t DB0R;            /*!< 0x024         CAN Interface Data B 0 Register                         */
  __IO uint32_t DB1R;            /*!< 0x028         CAN Interface Data B 1 Register                         */
} HT_CANIF_TypeDef;

/**
 * @brief Controller Area Network Global
 */
typedef struct
{
                                 /* CAN: 0x4000C000                                                         */
  __IO uint32_t    CR;           /*!< 0x000         Control Register                                        */
  __IO uint32_t    SR;           /*!< 0x004         Status Register                                         */
  __IO uint32_t    ECR;          /*!< 0x008         Error Counter Register                                  */
  __IO uint32_t    BTR;          /*!< 0x00C         Bit Timing Register                                     */
  __IO uint32_t    IR;           /*!< 0x010         Interrupt Register                                      */
  __IO uint32_t    TR;           /*!< 0x014         Test Register                                           */
  __IO uint32_t    BRPER;        /*!< 0x018         BRP Extension Register                                  */
       uint32_t    RESERVED0[1]; /*!< 0x01C         Reserved                                                */
  HT_CANIF_TypeDef IF0;          /*!< 0x020 - 0x048 CAN Interface 0 registers                               */
       uint32_t    RESERVED1[13];/*!< 0x04C - 0x07C Reserved                                                */
  HT_CANIF_TypeDef IF1;          /*!< 0x080 - 0x0A8 CAN Interface 1 registers                               */
       uint32_t    RESERVED2[21];/*!< 0x0AC - 0x0FC Reserved                                                */
  __IO uint32_t    TRR0;         /*!< 0x100         Transmission Request Register 0                         */
  __IO uint32_t    TRR1;         /*!< 0x104         Transmission Request Register 1                         */
       uint32_t    RESERVED3[6]; /*!< 0x108 - 0x11C Reserved                                                */
  __IO uint32_t    NDR0;         /*!< 0x120         New Data Register 0                                     */
  __IO uint32_t    NDR1;         /*!< 0x124         New Data Register 1                                     */
       uint32_t    RESERVED4[6]; /*!< 0x128 - 0x13C Reserved                                                */
  __IO uint32_t    IPR0;         /*!< 0x140         Interrupt Pending Register 0                            */
  __IO uint32_t    IPR1;         /*!< 0x144         Interrupt Pending Register 1                            */
       uint32_t    RESERVED5[6]; /*!< 0x148 - 0x15C Reserved                                                */
  __IO uint32_t    MVR0;         /*!< 0x160         Message Valid Register 0                                */
  __IO uint32_t    MVR1;         /*!< 0x164         Message Valid Register 1                                */
} HT_CAN_TypeDef;

