RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/Device/Holtek/HT32F5xxxx/Include/ht32f5xxxx_01.h
#if defined(USE_HT32F52234_44)
#define HT_PDMA                  ((HT_PDMA_TypeDef *) HT_PDMA_BASE)
#define HT_BFTM1                 ((HT_BFTM_TypeDef *) HT_BFTM1_BASE)
#define HT_PWM0                  ((HT_TM_TypeDef *) HT_PWM0_BASE)
#define HT_DAC0                  ((HT_DAC_TypeDef *) HT_DAC0_BASE)
#define HT_DAC1                  ((HT_DAC_TypeDef *) HT_DAC1_BASE)
#define HT_I2C1                  ((HT_I2C_TypeDef *) HT_I2C1_BASE)
#define HT_I2C2                  ((HT_I2C_TypeDef *) HT_I2C2_BASE)
#define HT_RTC                   ((HT_RTC_TypeDef *) HT_RTC_BASE)
#define HT_CRC                   ((HT_CRC_TypeDef *) HT_CRC_BASE)
#define HT_DIV                   ((HT_DIV_TypeDef *) HT_DIV_BASE)
#define HT_GPIOC                 ((HT_GPIO_TypeDef *) HT_GPIOC_BASE)
#endif

#if defined USE_HT32_DRIVER
  #include "ht32f5xxxx_lib.h"
#endif

/**
 * @brief Adjust the value of High Speed External oscillator (HSE)
          Tip: To avoid from modifying every time for different HSE, please define
          the "HSE_VALUE=n000000" ("n" represents n MHz) in your own toolchain compiler preprocessor,
          or edit the "HSE_VALUE" in the "ht32f5xxxx_conf.h" file.
  */
#if !defined  HSE_VALUE
  #if defined(USE_HT32F50220_30) || defined(USE_HT32F50231_41)
    /* Available HSE_VALUE: 4 MHz ~ 20 MHz                                                                  */
    #define HSE_VALUE       20000000UL /*!< Value of the External oscillator in Hz                          */
  #elif defined(USE_HT32F50020_30)
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       16000000UL  /*!< Value of the External oscillator in Hz                         */
  #elif defined(USE_HT32F0006)
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       12000000UL  /*!< Value of the External oscillator in Hz                         */
  #elif defined(USE_HT32F61244_45)
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       12000000UL  /*!< Value of the External oscillator in Hz                         */
  #elif defined(USE_HT32F67041_51)
    /* Available HSE_VALUE: 16 MHz                                                                          */
    #define HSE_VALUE       16000000UL  /*!< Value of the External oscillator in Hz                         */
  #else
    /* Available HSE_VALUE: 4 MHz ~ 16 MHz                                                                  */
    #define HSE_VALUE       8000000UL  /*!< Value of the External oscillator in Hz                          */
  #endif
#endif

/**
 * @brief Define for backward compatibility
 */
#define HT_ADC                   HT_ADC0
#define ADC                      ADC0
#define ADC_IRQn                 ADC0_IRQn

#define HT_DAC                   HT_DAC0
#define AFIO_FUN_DAC             AFIO_FUN_DAC0
#define CKCU_PCLK_DAC            CKCU_PCLK_DAC0

#if defined(USE_HT32F52357_67)
  #define UART0_IRQn             UART0_UART2_IRQn
  #define UART2_IRQn             UART0_UART2_IRQn
  #define UART1_IRQn             UART1_UART3_IRQn
  #define UART3_IRQn             UART1_UART3_IRQn
#endif

#if defined(USE_HT32F65230_40) || defined(USE_HT32F65232)
  // Alias
  #define GPTM0_IRQn             GPTM0_G_IRQn
  #define GPTM0_IRQHandler       GPTM0_G_IRQHandler
  #define MCTM0_IRQn             MCTM0_UP_IRQn
  #define MCTM0_IRQHandler       MCTM0_G_IRQHandler
  #define MCTM1_IRQn             MCTM1_UP_IRQn
  #define MCTM1_IRQHandler       MCTM1_G_IRQHandler
#endif

#define AFIO_ESS_Enum            u32

#if 0 // Set as 1 for backward compatibility
#if defined(USE_HT32F50020_30)
#define EXTI8_IRQn               EXTI0_1_IRQn
#define EXTI9_IRQn               EXTI0_1_IRQn
#define EXTI10_IRQn              EXTI2_3_IRQn
#define EXTI11_IRQn              EXTI2_3_IRQn
#define EXTI12_IRQn              EXTI4_7_IRQn
#define EXTI13_IRQn              EXTI4_7_IRQn
#define EXTI14_IRQn              EXTI4_7_IRQn
#define EXTI15_IRQn              EXTI4_7_IRQn

#define EXTI_CHANNEL_8           EXTI_CHANNEL_0
#define EXTI_CHANNEL_9           EXTI_CHANNEL_1
#define EXTI_CHANNEL_10          EXTI_CHANNEL_2
#define EXTI_CHANNEL_11          EXTI_CHANNEL_3
#define EXTI_CHANNEL_12          EXTI_CHANNEL_4
#define EXTI_CHANNEL_13          EXTI_CHANNEL_5
#define EXTI_CHANNEL_14          EXTI_CHANNEL_6
#define EXTI_CHANNEL_15          EXTI_CHANNEL_7
#endif
#endif

#if (LIBCFG_SPI_NO_MULTI_MASTER)
#define SPI_SELOutputCmd(...)
#endif

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif


/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT Holtek Semiconductor Inc. *****END OF FILE***                            */
